list_of_dicts = [
    {
        'Волгоград': 6,
        'Екатеринбург': 3,
        'Краснодар': 1,
        'Санкт-Петербург': 5,
        'Саратов': 2,
        'Тюмень': 6,
        'Уфа': 8
    },
    {
        'Волгоград': 1, 
        'Махачкала': 7, 
        'Новосибирск': 6, 
        'Самара': 7, 
        'Уфа': 5
    },
    {
        'Барнаул': 2,
        'Воронеж': 8,
        'Краснодар': 9,
        'Красноярск': 4,
        'Махачкала': 1,
        'Оренбург': 2,
        'Ростов-на-Дону': 1,
        'Самара': 1,
        'Тюмень': 2,
        'Хабаровск': 1
    },
    {
        'Владивосток': 3,
        'Воронеж': 4,
        'Ижевск': 9,
        'Иркутск': 6,
        'Казань': 2,
        'Краснодар': 5,
        'Нижний Новгород': 7,
        'Ульяновск': 1,
        'Челябинск': 7
    }
]
city_dict = {}
for set in list_of_dicts:
    for city, value in set.items():
        if city in city_dict:
            key = {value}
            city_dict[city] = city_dict[city].union(key)
        else:
            city_dict[city] = {value}
for city in city_dict:
    print (f'{city}:{city_dict[city]}')


# D:\Python\Ustinov\2023.06.11>7.py
# Волгоград:{1, 6}
# Екатеринбург:{3}
# Краснодар:{1, 5, 9}
# Санкт-Петербург:{5}
# Саратов:{2}
# Тюмень:{2, 6}
# Уфа:{8, 5}
# Махачкала:{1, 7}
# Новосибирск:{6}
# Самара:{1, 7}
# Барнаул:{2}
# Воронеж:{8, 4}
# Красноярск:{4}
# Оренбург:{2}
# Ростов-на-Дону:{1}
# Хабаровск:{1}
# Владивосток:{3}
# Ижевск:{9}
# Иркутск:{6}
# Казань:{2}
# Нижний Новгород:{7}
# Ульяновск:{1}
# Челябинск:{7}