# УДАЛИТЬ везде: в Python не используется точка с запятой
number = int(input());
# ИСПОЛЬЗОВАТЬ: длинные литералы удобно записывать на нескольких строчках кода следующим образом:
print (f'Следующее за числом {number} число: {number+1}\n'
       f'Для числа {number} предыдущее число: {number-1}')
# КОММЕНТАРИЙ: в круглых скобках записаны два строковых литерала, которые при вычислении объединяются в один с помощью неявной конкатенации — вне круглых скобок потребуется явная конкатенация


# D:\Python\Ustinov\2023.05.21>2.py
# 35
# Следующее за числом 35 число: 36
# Для числа 35 предыдущее число: 34


# ИТОГ: отлично — 3/3
